Revit 2026 API

# DisplacementElementCanElementsBeAddedToDisplacementSet Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanElementsBeAddedToDisplacementSet(
	ICollection<ElementId> toDisplace
)
```
```vb
Public Function CanElementsBeAddedToDisplacementSet (
	toDisplace As ICollection(Of ElementId)
) As Boolean
```
```cpp
public:
bool CanElementsBeAddedToDisplacementSet(
	ICollection<ElementId^>^ toDisplace
)
```
```fsharp
member CanElementsBeAddedToDisplacementSet :
        toDisplace : ICollection<ElementId> -> bool
```

#### Parameters

toDisplace ICollectionElementId

#### Return Value

Boolean

#### Reference

DisplacementElement Class

Autodesk.Revit.DB Namespace